In [42]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

pd.set_option('display.max_columns', 100)
pd.options.display.float_format = '{:.5f}'.format

In [7]:
# !pip install pyarrow

# 데이터 확인
* loan result

In [8]:
loan_result=pd.read_parquet('../data/loan_result.parquet',engine='pyarrow')
loan_result

,application_id,loanapply_insert_time,bank_id,product_id,loan_limit,loan_rate,is_applied
0,1748340,2022-06-07 13:05:41,7,191,42000000.0,13.6,NaN
1,1748340,2022-06-07 13:05:41,25,169,24000000.0,17.9,NaN
2,1748340,2022-06-07 13:05:41,2,7,24000000.0,18.5,NaN
3,1748340,2022-06-07 13:05:41,4,268,29000000.0,10.8,NaN
4,1748340,2022-06-07 13:05:41,11,118,5000000.0,16.4,NaN
...,...,...,...,...,...,...,...
13527358,1428218,2022-06-03 12:01:58,62,200,3000000.0,14.8,NaN
13527359,1428218,2022-06-03 12:01:49,2,7,40000000.0,11.8,NaN
13527360,1428218,2022-06-03 12:01:48,32,257,15000000.0,7.2,NaN
13527361,1428218,2022-06-03 12:01:48,33,110,44000000.0,13.5,NaN
13527362,1428218,2022-06-03 12:01:48,5,194,44000000.0,9.7,NaN

In [19]:
loan_result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13527363 entries, 0 to 13527362
Data columns (total 7 columns):
 #   Column                 Dtype
---  ------                 -----
 0   application_id         int32
 1   loanapply_insert_time  datetime64[ns]
 2   bank_id                int8
 3   product_id             int16
 4   loan_limit             float32
 5   loan_rate              float32
 6   is_applied             float32
dtypes: datetime64[ns](1), float32(3), int16(1), int32(1), int8(1)
memory usage: 348.3 MB

In [21]:
loan_result.isna().sum()

application_id                 0
loanapply_insert_time          0
bank_id                        0
product_id                     0
loan_limit                  7495
loan_rate                   7495
is_applied               3257239
dtype: int64

#### 결측치 상태
* 대출 한도와 대출 금리에 7495개 
* 신청여부(target)에 3257239개

In [10]:
loan_result.shape

(13527363, 7)

In [13]:
loan_result.drop_duplicates().shape

(13527337, 7)

In [15]:
loan_result.shape[0]-loan_result.drop_duplicates().shape[0]

26

중복값 26개

In [36]:
data = []
for f in loan_result.columns:
    # role 설정, 여기서는 target 피처가 없으므로 제외
    if f == 'application_id':
        role = 'id'
    else:
        role = 'input'

    # level 설정
    if loan_result[f].dtype == np.float32 or f == 'insert_time':
        if f == 'is_applied': # 개인회생자 여부 및 납입 완료 여부 또는 성별 피처
            level = 'binary'
        else:
            level = 'interval' # 그 외에 float와 시간 데이터
    else: # category형 변수 및 id
        level = 'nominal'

    # Keep 설정 (keep할지 버릴지에 대한 내용)
    keep = True
    if role == 'id':
        keep = False

    # dtype 설정
    dtype = loan_result[f].dtype

    f_dict = {
        'varname': f,
        'role' : role,
        'level' : level,
        'keep' : keep,
        'dtype' : dtype
    }

    data.append(f_dict)

meta = pd.DataFrame(data, columns=['varname', 'role', 'level', 'keep', 'dtype'])
meta = meta.set_index('varname')

In [51]:
meta

                        role     level   keep           dtype
varname
application_id            id   nominal  False           int32
loanapply_insert_time  input   nominal   True  datetime64[ns]
bank_id                input   nominal   True            int8
product_id             input   nominal   True           int16
loan_limit             input  interval   True         float32
loan_rate              input  interval   True         float32
is_applied             input    binary   True         float32

In [54]:
meta[(meta.level == 'nominal') & (meta.keep)].index

Index(['loanapply_insert_time', 'bank_id', 'product_id'], dtype='object', name='varname')

In [55]:
pd.DataFrame({'count' : meta.groupby(['role', 'level'])['role'].size()}).reset_index()

    role     level  count
0     id   nominal      1
1  input    binary      1
2  input  interval      2
3  input   nominal      3

In [56]:
meta.to_pickle('../data/meta_loan_result.pkl')

In [57]:
loan_result[meta[(meta.level == 'interval')& (meta.keep)].index].describe()

              loan_limit      loan_rate
count     13519868.00000 13519868.00000
mean      22424836.00000       12.89057
std       72035624.00000        3.81100
min              0.00000        1.50000
25%        9000000.00000        9.60000
50%       18000000.00000       13.20000
75%       33000000.00000       15.60000
max   230799998976.00000       20.00000

#### interval 컬럼
* loan_limit 7495개 결측값, right skewed, 2307억의 미친 max 값
* loan_rate 7495개 결측값, 상대적으로 균형잡힘

In [68]:
len(loan_result.groupby('application_id').count())
## application 길이

968866

In [69]:
v = meta[(meta.level == 'nominal') & (meta.keep)].index

for f in v:
    dist_values = loan_result[f].value_counts().shape[0]
    print('Variable {} has {} distinct values'.format(f, dist_values))

Variable loanapply_insert_time has 3220564 distinct values
Variable bank_id has 63 distinct values
Variable product_id has 188 distinct values

#### nominal 컬럼
* loanapply_insert_time 개수와 application_id 개수는 일치하지 않음(큰 의미 x)
* bank_id 수는 63개-> 63개의 금융사 
* product_id는 188개 -> 188개의 대출 상품

### target 컬럼 확인

In [80]:
len(loan_result[loan_result['is_applied'].isna()])

3257239

In [72]:
loan_result['is_applied'].mean()

0.05457081273198128

#### 결측치 많음
3257239개

#### 0과 1의 비율이 0.05로 불균형함
해결방안 모색 필요 (논문에서 0.25(1대4)정도의 비율 추천함)
* 언더샘플링
* 오버샘플링

### 달별 데이터 확인

In [88]:
month_lst=[]
for date in loan_result['loanapply_insert_time']:
    #print(date.year)
    #print(date.month)
    month_lst.append(date.month)
    #print(date.day)

In [89]:
loan_result['month']=month_lst

In [92]:
loan_result[loan_result['month']==6].isna().sum()

application_id                 0
loanapply_insert_time          0
bank_id                        0
product_id                     0
loan_limit                  1757
loan_rate                   1757
is_applied               3257239
month                          0
dtype: int64

6월 is_applied의 결측값이 전체 isapplied 결측값과 개수가 같음

6월 data를 test data

In [105]:
test=loan_result[loan_result['month']==6]
test.to_parquet('../data/test.parquet')

그외는 train data

In [104]:
train=loan_result[loan_result['month']!=6]
train.to_parquet('../data/train.parquet')